-- 1. Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
-- Н_ТИПЫ_ВЕДОМОСТЕЙ, Н_ВЕДОМОСТИ.
-- Вывести атрибуты: Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ИД.
-- Фильтры (AND):
-- a) Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ > Ведомость.
-- b) Н_ВЕДОМОСТИ.ЧЛВК_ИД < 153285.
-- c) Н_ВЕДОМОСТИ.ЧЛВК_ИД < 117219.
-- Вид соединения: LEFT JOIN.

SELECT
    "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД",
    "Н_ВЕДОМОСТИ"."ИД"
FROM "Н_ТИПЫ_ВЕДОМОСТЕЙ"
    LEFT JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ТВ_ИД" = "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД"
WHERE
    ("Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ" > 'Ведомость'
    AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 153285
    AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 117219);