-- 5. Выведите таблицу со средним возрастом студентов во всех группах (Группа, Средний возраст), где средний возраст больше минимального возраста в группе 1101.

SELECT
    "ГРУППА",
    EXTRACT(YEAR FROM AVG(AGE("ДАТА_РОЖДЕНИЯ"))) AS "СР. ВОЗРАСТ"
FROM "Н_УЧЕНИКИ"
    INNER JOIN "Н_ЛЮДИ" ON ("ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
WHERE
    ("Н_УЧЕНИКИ"."ПРИЗНАК" = 'обучен'
    AND "ДАТА_РОЖДЕНИЯ" < CURRENT_DATE)
GROUP BY "ГРУППА"
HAVING AVG(AGE("ДАТА_РОЖДЕНИЯ")) >
       (SELECT MIN(AGE("ДАТА_РОЖДЕНИЯ"))
        FROM "Н_УЧЕНИКИ"
            INNER JOIN "Н_ЛЮДИ" ON ("Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
        WHERE
            ("Н_УЧЕНИКИ"."ПРИЗНАК" = 'обучен'
            AND "ГРУППА" = '1101'
            AND "ДАТА_РОЖДЕНИЯ" < CURRENT_DATE)
        GROUP BY "ГРУППА");
