-- 6. Получить список студентов, зачисленных после первого сентября 2012 года на первый курс очной формы обучения. В результат включить:
-- номер группы;
-- номер, фамилию, имя и отчество студента;
-- номер и состояние пункта приказа;
-- Для реализации использовать подзапрос с EXISTS.

SELECT
    "ВНЕШ_ЗАПРОС"."ГРУППА",
    "Н_ЛЮДИ"."ФАМИЛИЯ",
    "Н_ЛЮДИ"."ИМЯ",
    "Н_ЛЮДИ"."ОТЧЕСТВО",
    "ВНЕШ_ЗАПРОС"."П_ПРКОК_ИД"
FROM "Н_УЧЕНИКИ" AS "ВНЕШ_ЗАПРОС"
    INNER JOIN "Н_ЛЮДИ" ON ("ВНЕШ_ЗАПРОС"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
    INNER JOIN "Н_ПЛАНЫ" ON ("ВНЕШ_ЗАПРОС"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД")
    INNER JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON ("Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД")
WHERE
    ("Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
    AND EXISTS (SELECT 1
                FROM "Н_УЧЕНИКИ" AS "ВНУТР_ЗАПРОС"
                WHERE
                    ("ВНУТР_ЗАПРОС"."СОСТОЯНИЕ" = 'утвержден'
                    AND "ВНУТР_ЗАПРОС"."ИД" = "ВНЕШ_ЗАПРОС"."ИД"
                    AND "ВНУТР_ЗАПРОС"."НАЧАЛО" > TO_TIMESTAMP('01-09-2012', 'DD-MM-YYYY'))));