-- 1
SELECT
    "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД",
    "Н_ВЕДОМОСТИ"."ИД"
FROM "Н_ТИПЫ_ВЕДОМОСТЕЙ"
    LEFT JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ТВ_ИД" = "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД"
WHERE
    ("Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ" > 'Ведомость'
    AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 153285
    AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 117219);

-- 2
SELECT
    "Н_ЛЮДИ"."ИМЯ",
    "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД",
    "Н_УЧЕНИКИ"."ИД"
FROM "Н_ЛЮДИ"
    LEFT JOIN "Н_ОБУЧЕНИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
    LEFT JOIN "Н_УЧЕНИКИ" USING ("ЧЛВК_ИД")
WHERE
    ("Н_ЛЮДИ"."ОТЧЕСТВО" > 'Георгиевич'
    AND CAST("Н_ОБУЧЕНИЯ"."НЗК" AS INT) > 999080);

-- 3
SELECT
    CASE
        WHEN COUNT(*) > 0 THEN 'ДА'
        ELSE 'НЕТ'
        END AS "ОТВЕТ",
    COUNT(*) AS "КОЛ-ВО"
FROM "Н_УЧЕНИКИ"
    INNER JOIN "Н_ЛЮДИ" ON ("ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
WHERE
    ("ПРИЗНАК" = 'обучен'
    AND "ГРУППА" = '3102'
    AND EXTRACT(YEAR FROM AGE("ДАТА_РОЖДЕНИЯ")) > 25);

-- 4
SELECT "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД"
FROM "Н_ГРУППЫ_ПЛАНОВ"
    INNER JOIN "Н_ПЛАНЫ" ON "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
    INNER JOIN "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ'
GROUP BY "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД"
HAVING COUNT(*) > 2;

-- 5
SELECT
    "ГРУППА",
    EXTRACT(YEAR FROM AVG(AGE("ДАТА_РОЖДЕНИЯ"))) AS "СР. ВОЗРАСТ"
FROM "Н_УЧЕНИКИ"
    INNER JOIN "Н_ЛЮДИ" ON ("ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
WHERE
    ("Н_УЧЕНИКИ"."ПРИЗНАК" = 'обучен'
    AND "ДАТА_РОЖДЕНИЯ" < CURRENT_DATE)
GROUP BY "ГРУППА"
HAVING AVG(AGE("ДАТА_РОЖДЕНИЯ")) >
       (SELECT MIN(AGE("ДАТА_РОЖДЕНИЯ"))
        FROM "Н_УЧЕНИКИ"
            INNER JOIN "Н_ЛЮДИ" ON ("Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
        WHERE
            ("Н_УЧЕНИКИ"."ПРИЗНАК" = 'обучен'
            AND "ГРУППА" = '1101'
            AND "ДАТА_РОЖДЕНИЯ" < CURRENT_DATE)
        GROUP BY "ГРУППА");

-- 6
SELECT
    "ВНЕШ_ЗАПРОС"."ГРУППА",
    "Н_ЛЮДИ"."ФАМИЛИЯ",
    "Н_ЛЮДИ"."ИМЯ",
    "Н_ЛЮДИ"."ОТЧЕСТВО",
    "ВНЕШ_ЗАПРОС"."П_ПРКОК_ИД"
FROM "Н_УЧЕНИКИ" AS "ВНЕШ_ЗАПРОС"
    INNER JOIN "Н_ЛЮДИ" ON ("ВНЕШ_ЗАПРОС"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД")
    INNER JOIN "Н_ПЛАНЫ" ON ("ВНЕШ_ЗАПРОС"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД")
    INNER JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON ("Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД")
WHERE
    ("Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
    AND EXISTS (SELECT 1
                FROM "Н_УЧЕНИКИ" AS "ВНУТР_ЗАПРОС"
                WHERE
                    ("ВНУТР_ЗАПРОС"."СОСТОЯНИЕ" = 'утвержден'
                    AND "ВНУТР_ЗАПРОС"."ИД" = "ВНЕШ_ЗАПРОС"."ИД"
                    AND "ВНУТР_ЗАПРОС"."НАЧАЛО" > TO_TIMESTAMP('01-09-2012', 'DD-MM-YYYY'))));

-- 7
SELECT
    *
FROM "Н_ЛЮДИ"
WHERE NOT EXISTS (SELECT 1
                  FROM "Н_УЧЕНИКИ"
                  WHERE "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД");
