# -*- coding: utf-8 -*-
"""Задание 2.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1qWQiFcOebRJNkZkSyazF2KczU04eYFYM

# 2.2 Шаблон задания для СР (Занятие 2)

1) Сначала скачайте файл `variant_*.csv` из генератора (HTML-страница).  
2) Загрузите CSV рядом с ноутбуком (в Colab: через кнопку «📁 Файлы» в левой боковом меню. Затем нажмите на кнопку "📤 Загрузить в сессионное хранилище").  
3) В коде ниже замените имя файла `variant_3.csv` на свой вариант и дополняйте строки с `...`.
"""

# (Необязательно) Colab: загрузка файла variant_*.csv
# from google.colab import files
# files.upload()

import numpy as np
import matplotlib.pyplot as plt

# -------------------------------------------------
# ЗАДАНИЕ: Первичная обработка выборки
# -------------------------------------------------
# ШАГ 0: Загрузите свою выборку (замените номер файла на ваш вариант)
data = np.loadtxt('variant_7.csv', delimiter=',')

print(f"Объём выборки: n = {len(data)}")
print()

# -------------------------------------------------
# ШАГ 1: Вариационный ряд
# -------------------------------------------------
# ДОПОЛНИТЕ КОД:
sorted_data = np.sort(data)
print("Вариационный ряд:\n", np.array2string(sorted_data, separator=', '))
print("Первые 5 элементов: ", np.array2string(sorted_data[0:5], separator=', '))
print("Последние 5 элементов: ", np.array2string(sorted_data[-5:], separator=', '))
print()
# Выведите первые 5 и последние 5 значений вариационного ряда

# -------------------------------------------------
# ШАГ 2: Выборочные оценки
# -------------------------------------------------
# ДОПОЛНИТЕ КОД:
x_bar = np.average(data)       # среднее
s2 = np.var(data, ddof=1)          # дисперсия (несмещённая!)
# s2_test = 1/(len(data)-1) * np.sum([(data[i]-x_bar)**2 for i in range(len(data))])
s = np.std(data, ddof=1)           # стандартное отклонение
# s = s2**0.5
median = np.median(data)      # медиана
x_min = np.min(data)       # минимум
x_max = np.max(data)       # максимум

print("Выборочные оценки:")
print(f"  Среднее:      x̄ = ", x_bar)
print(f"  Дисперсия:    s² = ", s2)
print(f"  Ст. откл.:    s = ", s)
print(f"  Медиана:      x̃ = ", median)
print(f"  Размах:       [{x_min:.1f}, {x_max:.1f}]")
print()

# -------------------------------------------------
# ШАГ 3: Правило Скотта и гистограмма
# -------------------------------------------------
# ДОПОЛНИТЕ КОД:
n = len(data)
# s = ...  # уже посчитано в Шаге 2
h = 3.5 * s * n**(-1/3)
k = int(np.ceil((x_max - x_min)/h))  # число интервалов (округлить вверх)

print(f"Правило Скотта:")
print(f"  Ширина интервала: h = {h:.2f}")
print(f"  Число интервалов: k = {k}")
print()

# Постройте ДВЕ гистограммы рядом:
#  а) с числом интервалов по Скотту
#  б) с фиксированным числом интервалов = 5
# Добавьте на каждую вертикальную линию со средним значением
plt.figure(figsize=(7, 4))
plt.hist(sorted_data, bins=k, edgecolor='black', alpha=0.7)
plt.title('Гистограмма (правило Скотта)')
plt.xlabel('Значения')
plt.ylabel('Частота')
plt.grid(True, linestyle=':', alpha=0.6)
plt.axvline(x=x_bar, color='red', linestyle='--', label='Среднее')
plt.legend()
plt.tight_layout()

plt.figure(figsize=(7, 4))
plt.hist(sorted_data, bins=5, edgecolor='black', alpha=0.7)
plt.title('Гистограмма (фикс. число интервалов)')
plt.xlabel('Значения')
plt.ylabel('Частота')
plt.grid(True, linestyle=':', alpha=0.6)
plt.axvline(x=x_bar, color='red', linestyle='--', label='Среднее')
plt.legend()
plt.tight_layout()

# -------------------------------------------------
# ШАГ 4: Полигон частот
# -------------------------------------------------
# ДОПОЛНИТЕ КОД:
# Постройте полигон частот для интервального ряда
# (используйте те же интервалы, что и в гистограмме по Скотту)
plt.figure(figsize=(7, 4))
hist, bin_edges = np.histogram(sorted_data, bins=k)
bin_centers = (bin_edges[:-1] + bin_edges[1:]) / 2
plt.hist(sorted_data, bins=k, edgecolor='black', alpha=0.7, rwidth=0.3)
plt.plot(bin_centers, hist, marker='o', linestyle='-', color='b')
plt.title('Полигон частот')
plt.xlabel('Значения')
plt.ylabel('Частота')
plt.grid(True, linestyle=':', alpha=0.6)
plt.tight_layout()

# -------------------------------------------------
# ШАГ 5: Эмпирическая функция распределения
# -------------------------------------------------
# ДОПОЛНИТЕ КОД:
# Постройте график ЭФР с пунктирными вертикалями в точках скачков
# и точками на горизонтальных участках
plt.figure(figsize=(7, 4))
f = np.arange(1, n + 1) / n
plt.step(sorted_data, f, where='post', label='Эмпирическая функция распределения', linewidth=2, color='blue')
# f_bottom = np.concatenate(([0], f[:-1]))
# plt.vlines(sorted_data, f_bottom, f, linestyles='dashed', colors='red', label='Скачки', linewidth=1.5)
plt.scatter(sorted_data, f, color='blue', s=1, alpha=0.5) # точки скачков
plt.title('Эмпирическая функция распределения с вертикальными скачками')
plt.xlabel('x')
plt.ylabel('Fₙ(x)')
plt.grid(True, linestyle=':', alpha=0.6)
plt.legend()
plt.tight_layout()
# -------------------------------------------------
# ШАГ 6: Сравнение с истинными параметрами
# -------------------------------------------------
# Истинные параметры вашего варианта:
mu_true = 80
sigma2_true = 100

print("Сравнение с истинными параметрами:")
print(f"  Истинное μ = {mu_true}, выборочное x̄ = {x_bar}")
print(f"  Истинное σ² = {sigma2_true}, выборочное s² = {s2}")
print()
print("Вопрос: Почему выборочные оценки отличаются от истинных параметров?")
print("Ответ: В основном из-за конечности и случайности выборки; \nСогласно ЗБЧ, при увеличении объема выборки (n -> inf) оценки будут стремиться к истинным параметрам генеральной совокупности.")

plt.show()
