import re

# ISU: 467307 
# Nikita "sadnex" Ryazanov

# 467307 % 6 = 3
# 467307 % 4 = 3
# 467307 % 8 = 3 

# Main task

# Eyes :
# Nose <{
# Mouth |
# Emoji :<{|  

texts = [
    # 1
    '''После долгого дня я сел за стол с чашкой чая. Взяв в руки книгу, я открыл её на 
    случайной странице. Вдруг в тексте
    мелькнуло что-то странное. Сперва я не обратил внимания, но затем заметил, что это повторяется снова
    :<{| и снова
    :<{|. Может, это шутка автора или секретное послание?''',
    # Answer: 2

    # 2
    "В отпуске я оказался на маленьком острове посреди океана. Тишина, только шум прибоя и крики чаек. Когда я вышел на берег, я заметил странные знаки на песке :<{| :<{| :<{|. Ветер быстро их стёр, и я так и не успел разобраться, что это было. Были ли это следы животных или чьё-то послание? Я решил не придавать этому значения, но всё же осадок остался.",
    # Answer: 3

    # 3
    '!@#$%^&*()_+[]{}|;:\'",.<>/?`~:<{|*&^%$#@!~`1234567890-=:<{|<>?:{[|}]*&^%$#@!{<|:<{|}|',
    # Answer: 0

    # 4
    '''На уроке геометрии учитель объяснял новые теоремы, но мой взгляд постоянно возвращался к доске, где среди формул кто-то нарисовал символ :<{|
    . В этот момент я заметил, что в тетради на случайной странице 
    тот же знак появился несколько раз подряд :<{| :<{|. Странно, ведь
    я точно не рисовал их сам. Как они там оказались? Позже я нашёл ещё пару таких символов на парте 
    :<{|''',
    # Answer: 4

    # 5
    "Утро началось с :<{| странного :<{| звука, когда телефон :<{| упал с :<{| полки прямо на :<{| книжку, которая лежала :<{| рядом с :<{| старым компьютером. Птицы :<{| за окном весело пели, :<{| но :<{| моя :<{| чашка кофе осталась :<{| недопитой. Решил :<{| пойти прогуляться, :<{| но заметил :<{| странную тень :<{| на полу, которая :<{| напомнила мне про тот :<{| случай с :<{| библиотекой. Как только :<{| я открыл :<{| дверь, на пороге лежало письмо :<{|, содержащее :<{| странные символы, среди которых :<{| был тот самый знак :<{|. Деревья за окном :<{| шумели, а небо :<{| потемнело так быстро, что я :<{| едва успел :<{| заметить, как :<{| с неба начали падать :<{| листья, и каждый лист :<{| имел на себе этот знак :<{|. Вернувшись домой :<{|, я открыл :<{| компьютер и увидел, что весь экран :<{| был покрыт :<{| этими символами :<{| :<{| :<{| :<{| :<{|."
    # Answer: 42
]

print("Main task: ")
pattern = re.compile(r"(?:\s)(:<\{\|)(?:\B)")
for i, t in enumerate(texts):
    print(f'{i + 1}. {len(pattern.findall(t))}')
print()


# Additional task #1
texts = [
    # 1
    "На утреннем семинаре по экологии докладывали два специалиста: Николаев И.А. и Сергеева Т.Л. В то время как они обсуждали влияние человека на природу, в аудитории сидели друзья — Оля и Саша, которые не могли дождаться перерыва.",
    # Answer: 
    # Николаев
    # Сергеева

    # 2
    "После долгого рабочего дня я встретил свою подругу Марию. Она рассказала, что только что вернулась из путешествия по Европе с Петровой-Ковалевой М.Н., которая на самом деле была её соседкой. Ryazanov N.S., Testovich T. T.",
    # Answer:
    # Ryazanov
    # Testovich
    # Петровой-Ковалевой

    # 3
    "Вечером на концерте выступили три музыканта: Сидорова А.П., Романов В.Д. и Тихонов С.С. В это время Аня и Вика обсуждали, какой из исполнителей им понравился больше.",
    # Answer:
    # Романов
    # Сидорова
    # Тихонов

    # 4
    "После уроков на площадке собрались школьники. Шевченко И.В. показывал трюки на скейтборде, а Громова А.А. записывала всё на свой телефон, в то время как Саша играл с мячом.",
    # Answer:
    # Громова
    # Шевченко

    # 5
    "Студент Вася вспомнил, что на своей лекции Балакшин П.В. упоминал про старшекурсников, которые будут ему помогать: Анищенко А.А., Машина Е.А. и Голованова-Иванова Д.В."
    # Answer:
    # Анищенко 
    # Балакшин 
    # Голованова-Иванова 
    # Машина
]

print("Additional task #1")
pattern = re.compile(r"(?:((?:[А-Я][а-я]*){1}(?:-[А-Я][а-я]*)?)\s[А-Я]\.(?:\b|\s)[А-Я]\.)" + r"|" + \
                     r"(?:((?:[A-Z][a-z]*){1}(?:-[A-Z][a-z]*)?)\s[A-Z]\.(?:\b|\s)[A-Z]\.)")
for i, t in enumerate(texts):
    surnames = sorted([''.join(s) for s in pattern.findall(t)])
    print(f'{i + 1}.')
    for s in surnames:
        print(s)
print()


# Additional task #2
texts = [
    # 1
    "В классе учится 25 учеников, и 12 из них предпочитают математику, а остальные 13 — физику.",
    # Answer:
    # "В классе учится 2493 учеников, и 569 из них предпочитают математику, а остальные 669 — физику."

    # 2
    "В магазине было 50 яблок, но после распродажи осталось только 20.",
    # Answer: "В магазине было 9993 яблок, но после распродажи осталось только 1593."

    # 3
    "15 + 20 = 35",
    # Answer: "893 + 1593 = 4893"

    # 4
    "18 / 3 = 6",
    # Answer: "1289 / 29 = 137"

    # 5
    "На столе 12 пирожков, а в холодильнике -8. Если я заберу 4 пирожка, останется 16. 12 плюс -4 равно 16."
    # Answer: "На столе 569 пирожков, а в холодильнике 249. Если я заберу 57 пирожка, останется 1017. 569 плюс 57 равно 1017."
]

print("Additional task #2")

def func(x):
    # print(type(x), x.group(0))
    x = int(x.group(0))
    return str(4 * x * x - 7)

pattern = re.compile(r"-?[0-9]+")
for i, t in enumerate(texts):
    print(f'{i + 1}.')
    print("Before: ")
    print(t)
    print("After:")
    print(pattern.sub(func, t))
    print()