-- EXPLAIN ANALYSE
SELECT
    "Н_ЛЮДИ"."ФАМИЛИЯ",
    "Н_ВЕДОМОСТИ"."ИД",
    "Н_СЕССИЯ"."ДАТА"
FROM "Н_ЛЮДИ"
    RIGHT JOIN "Н_ВЕДОМОСТИ" ON ("Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД")
    RIGHT JOIN "Н_СЕССИЯ" ON ("Н_ВЕДОМОСТИ"."СЭС_ИД" = "Н_СЕССИЯ"."СЭС_ИД")
WHERE ("Н_ЛЮДИ"."ИМЯ" = 'Владимир'
    AND "Н_ВЕДОМОСТИ"."ДАТА" < '1998-01-05'
    AND "Н_СЕССИЯ"."ДАТА" > '2004-01-17');

-- indexes:
-- CREATE INDEX "ИНДЕКС_Н_ЛЮДИ_ИМЯ" ON "Н_ЛЮДИ" USING hash("ИМЯ");
-- CREATE INDEX "ИНДЕКС_Н_ВЕДОМОСТИ_ДАТА" ON "Н_ВЕДОМОСТИ" USING btree("ДАТА");
-- CREATE INDEX "ИНДЕКС_Н_СЕССИЯ_ДАТА" ON "Н_СЕССИЯ" USING btree("ДАТА");
-- CREATE INDEX "ИНДЕКС_Н_ВЕДОМОСТИ_ЧЛВК_ИД" ON "Н_ВЕДОМОСТИ" USING hash("ЧЛВК_ИД");
-- CREATE INDEX "ИНДЕКС_Н_СЕССИЯ_СЭС_ИД" ON "Н_СЕССИЯ" USING hash("СЭС_ИД");